import React from "react";
import { useTheme } from "../contexts/ThemeContext";
import footballImg from "../assets/football.jpg";
import bladeRunnerImg from "../assets/blade_runner_2049.jpg";
import dishImg from "../assets/dish.jpg";


export default function HobbiesPage() {
  const { theme } = useTheme();

  const containerClass =
    theme === "light" ? "container py-5 text-dark" : "container py-5 text-light";

  const sectionClass = "mb-5";

  return (
    <div className={containerClass}>
      {/* Хоббі */}
      <section className={sectionClass}>
        <h1 className="mb-3">Хоббі</h1>
        <p className="mb-3">
          Моє улюблене хобі це футбол, тому я підготував декілька цікавих фактів про футбол:
        </p>
        <div className="custom-list">
          <h3>Футбол є найпопулярнішим видом спорту у світі</h3>
          <p>За оцінками, у світі налічується близько 4 мільярдів прихильників футболу. Це робить футбол найпопулярнішим видом спорту на планеті.</p>

          <h3>Найдовша футбольна гра тривала більше 3 діб</h3>
          <p>Рекорд за тривалістю футбольного матчу був встановлений у 1981 році в Англії. Гра між командами «Скворінгс Барн» та «Вест Бромвіч Олбіон» тривала 73 години, 35 хвилин і 7 секунд. Матч було зіграно на благодійній основі, а метою було збір коштів для лікарні.</p>

          <h3>Найстаріший футбольний клуб у світі</h3>
          <p>Шеффілд ФК – найстаріший футбольний клуб у світі, заснований у 1857 році в Англії. Цей клуб не має професійного статусу, але він увійшов в історію як перша організація, що популяризувала футбол як гру з єдиними правилами.</p>

          <h3>Футбол як двигун економіки</h3>
          <p>Футбол не тільки приносить радість мільйонам вболівальників, але й є важливим чинником економіки. Великі чемпіонати та турніри приносять мільярди доларів доходу країнам-організаторам, туристичній галузі та спортивним брендам.</p>
        </div>
        <img src={footballImg} alt="Футбол" className="img-custom rounded mb-4" />
      </section>

      {/* Фільм */}
      <section className={sectionClass}>
        <h1 className="mb-3">Фільм</h1>
        <p className="mb-3">
          Один з моїх найулюбленіших фільмів це "Той хто біжить по лезу 2049".
        </p>
        <h3 className="mb-2">Опис фільму</h3>
        <p className="mb-3">
          У недалекому майбутньому світ населений людьми та реплікантами, створеними виконувати найважчу роботу. Робота офіцера поліції Кей - тримати реплікантів під контролем в умовах напруги, що наростає... Поки що він випадково не стає володарем секретної інформації, яка ставить під загрозу існування всього людства. Бажаючи знайти ключ до розгадки, Кей вирішує розшукати Ріка Декарда, колишнього офіцера спеціального підрозділу поліції Лос-Анджелеса, який безвісти зник багато років тому.
        </p>
        <img src={bladeRunnerImg} alt="Blade Runner 2049" className="img-custom rounded mb-4" />
      </section>

      {/* Страва */}
      <section className={sectionClass}>
        <h1 className="mb-3">Страва</h1>
        <p className="mb-3">
          Моя найулюбленіша страва - це пюрешка з котлетою по-київськи, тому я підготував рецепт приготування.
        </p>
        <h3 className="mb-2">Час приготування</h3>
        <p className="mb-3">40 хвилин</p>
        <h3 className="mb-2">Інгредієнти</h3>
        <p className="mb-3">Картопля - 300г, котлета по-київськи  - 2шт, вершкове масло або крем сир - 30г</p>
        <h3 className="mb-2">Кроки приготування:</h3>
        <div className="custom-list">
          <p>1. Картоплю очистіть від шкірки та наріжте на кубики.</p>
          <p>2. Картоплю викладіть у глибоку каструлю, додайте достатню кількість води та сіль. Доведіть до кипіння.</p>
          <p>3. Потім зменшіть вогонь і продовжуйте варити картоплю до м’якості (15-20 хв).</p>
          <p>4. Відкиньте воду негайно після того, як картопля буде відварена.</p>
          <p>5. Додайте орегано, перець та вершкове масло або крем сир.</p>
          <p>6. Використовуючи виделку, перетворіть картоплю на пюре.</p>
          <p>7. Розморожену котлету обсмажте у фритюрі або на пательні 5-7 хв, можна запекти у духовці при 170°C.</p>
        </div>
        <img src={dishImg} alt="Страва" className="img-custom rounded mb-4" />
      </section>
    </div>
  );
}
